{
  "caption": "Network",
  "category": "network",
  "description": "Network event is a generic event that defines a set of attributes available in the Network category.",
  "extends": "base_event",
  "name": "network",
  "attributes": {
    "$include": [
      "profiles/network_proxy.json",
      "profiles/load_balancer.json"
    ],
    "app_name": {
      "group": "context",
      "requirement": "optional"
    },
    "connection_info": {
      "group": "primary",
      "requirement": "recommended"
    },
    "cumulative_traffic": {
      "description": "The cumulative (running total) network traffic aggregated from the start of a flow or session. Use when reporting: (1) total accumulated bytes/packets since flow initiation, (2) combined aggregation models where both incremental deltas and running totals are reported together (populate both <code>traffic</code> for the delta and this attribute for the cumulative total), or (3) final summary metrics when a long-lived connection closes. This represents the sum of all activity from flow start to the current observation, not a delta or point-in-time value.",
      "group": "context",
      "requirement": "optional"
    },
    "dst_endpoint": {
      "description": "The responder (server) in a network connection.",
      "group": "primary",
      "requirement": "recommended"
    },
    "ja4_fingerprint_list": {
      "group": "context",
      "requirement": "optional"
    },
    "observation_point": {
      "description": "Indicates whether the source network endpoint, destination network endpoint, or neither served as the observation point for the activity. The value is normalized to the caption of the <code>observation_point_id</code>.",
      "requirement": "optional"
    },
    "observation_point_id": {
      "description": "The normalized identifier of the observation point. The observation point identifier indicates whether the source network endpoint, destination network endpoint, or neither served as the observation point for the activity.",
      "requirement": "optional",
      "enum": {
        "0": {
          "caption": "Unknown",
          "description": "The observation point is unknown."
        },
        "1": {
          "caption": "Source",
          "description": "The source network endpoint is the observation point."
        },
        "2": {
          "caption": "Destination",
          "description": "The destination network endpoint is the observation point."
        },
        "3": {
          "caption": "Neither",
          "description": "Neither the source nor destination network endpoint is the observation point."
        },
        "4": {
          "caption": "Both",
          "description": "Both the source and destination network endpoint are the observation point. This typically occurs in localhost or internal communications where the source and destination are the same endpoint, often resulting in a <code>connection_info.direction</code> of <code>Local</code>."
        },
        "99": {
          "caption": "Other",
          "description": "The observation point is not mapped. See the <code>observation_point</code> attribute for a data source specific value."
        }
      }
    },
    "proxy": {
      "group": "primary",
      "requirement": "recommended"
    },
    "src_endpoint": {
      "description": "The initiator (client) of the network connection.",
      "group": "primary",
      "requirement": "recommended"
    },
    "tls": {
      "group": "context",
      "requirement": "optional"
    },
    "traffic": {
      "description": "The network traffic for this observation period. Use when reporting: (1) delta values (bytes/packets transferred since the last observation), (2) instantaneous measurements at a specific point in time, or (3) standalone single-event metrics. This attribute represents a point-in-time measurement or incremental change, not a running total. For accumulated totals across multiple observations or the lifetime of a flow, use <code>cumulative_traffic</code> instead.",
      "group": "primary",
      "requirement": "recommended"
    }
  },
  "constraints": {
    "at_least_one": [
      "dst_endpoint",
      "src_endpoint"
    ]
  },
  "profiles": [
    "network_proxy",
    "load_balancer"
  ]
}