{
  "caption": "CVE",
  "description": "The Common Vulnerabilities and Exposures (CVE) object represents publicly disclosed cybersecurity vulnerabilities defined in CVE Program catalog (<a target='_blank' href='https://cve.mitre.org/'>CVE</a>). There is one CVE Record for each vulnerability in the catalog.",
  "extends": "object",
  "name": "cve",
  "attributes": {
    "created_time": {
      "description": "The Record Creation Date identifies when the CVE ID was issued to a CVE Numbering Authority (CNA) or the CVE Record was published on the CVE List. Note that the Record Creation Date does not necessarily indicate when this vulnerability was discovered, shared with the affected vendor, publicly disclosed, or updated in CVE.",
      "requirement": "recommended"
    },
    "cvss": {
      "requirement": "recommended"
    },
    "cwe": {
      "requirement": "optional",
      "@deprecated": {
        "message": "Use <code>related_cwes</code> attribute instead.",
        "since": "1.4.0"
      }
    },
    "cwe_uid": {
      "requirement": "optional"
    },
    "cwe_url": {
      "requirement": "optional"
    },
    "desc": {
      "description": "A brief description of the CVE Record.",
      "requirement": "optional"
    },
    "epss": {
      "requirement": "optional"
    },
    "modified_time": {
      "description": "The Record Modified Date identifies when the CVE record was last updated.",
      "requirement": "optional"
    },
    "product": {
      "description": "The product where the vulnerability was discovered.",
      "requirement": "optional"
    },
    "references": {
      "description": "A list of reference URLs with additional information about the CVE Record.",
      "requirement": "recommended"
    },
    "related_cwes": {
      "description": "Describes the Common Weakness Enumeration <a target='_blank' href='https://cwe.mitre.org/'>(CWE)</a> details related to the CVE Record.",
      "requirement": "optional"
    },
    "title": {
      "description": "A title or a brief phrase summarizing the CVE record.",
      "requirement": "recommended"
    },
    "type": {
      "caption": "Vulnerability Type",
      "description": "<p>The vulnerability type as selected from a large dropdown menu during CVE refinement.</p>Most frequently used vulnerability types are: <code>DoS</code>, <code>Code Execution</code>, <code>Overflow</code>, <code>Memory Corruption</code>, <code>Sql Injection</code>, <code>XSS</code>, <code>Directory Traversal</code>, <code>Http Response Splitting</code>, <code>Bypass something</code>, <code>Gain Information</code>, <code>Gain Privileges</code>, <code>CSRF</code>, <code>File Inclusion</code>. For more information see <a target='_blank' href='https://www.cvedetails.com/vulnerabilities-by-types.php'>Vulnerabilities By Type</a> distributions.",
      "requirement": "recommended"
    },
    "uid": {
      "observable": 18,
      "caption": "CVE ID",
      "description": "The Common Vulnerabilities and Exposures unique number assigned to a specific computer vulnerability. A CVE Identifier begins with 4 digits representing the year followed by a sequence of digits that acts as a unique identifier. For example: <code>CVE-2021-12345</code>.",
      "requirement": "required"
    }
  }
}