{
  "caption": "Evidence Artifacts",
  "description": "A collection of evidence artifacts associated to the activity/activities that triggered a security detection.",
  "extends": "object",
  "name": "evidences",
  "attributes": {
    "actor": {
      "description": "Describes details about the user/role/process that was the source of the activity that triggered the detection.",
      "requirement": "recommended"
    },
    "api": {
      "description": "Describes details about the API call associated to the activity that triggered the detection.",
      "requirement": "recommended"
    },
    "container": {
      "description": "Describes details about the container associated to the activity that triggered the detection.",
      "requirement": "recommended"
    },
    "connection_info": {
      "description": "Describes details about the network connection associated to the activity that triggered the detection.",
      "requirement": "recommended"
    },
    "data": {
      "description": "Additional evidence data that is not accounted for in the specific evidence attributes.<code> Use only when absolutely necessary.</code>",
      "requirement": "optional"
    },
    "database": {
      "description": "Describes details about the database associated to the activity that triggered the detection.",
      "requirement": "recommended"
    },
    "databucket": {
      "description": "Describes details about the databucket associated to the activity that triggered the detection.",
      "requirement": "recommended"
    },
    "device": {
      "description": "An addressable device, computer system or host associated to the activity that triggered the detection.",
      "requirement": "recommended"
    },
    "dst_endpoint": {
      "description": "Describes details about the destination of the network activity that triggered the detection.",
      "requirement": "recommended"
    },
    "email": {
      "description": "The email object associated to the activity that triggered the detection.",
      "requirement": "recommended"
    },
    "file": {
      "description": "Describes details about the file associated to the activity that triggered the detection.",
      "requirement": "recommended"
    },
    "process": {
      "description": "Describes details about the process associated to the activity that triggered the detection.",
      "requirement": "recommended"
    },
    "query": {
      "description": "Describes details about the DNS query associated to the activity that triggered the detection.",
      "requirement": "recommended"
    },
    "src_endpoint": {
      "description": "Describes details about the source of the network activity that triggered the detection.",
      "requirement": "recommended"
    },
    "url": {
      "description": "The URL object that pertains to the event or object associated to the activity that triggered the detection.",
      "requirement": "recommended"
    },
    "user": {
      "description": "Describes details about the user that was the target or somehow else associated with the activity that triggered the detection.",
      "requirement": "recommended"
    }
  },
  "constraints": {
    "at_least_one": [
      "actor",
      "api",
      "connection_info",
      "data",
      "database",
      "databucket",
      "device",
      "dst_endpoint",
      "email",
      "file",
      "process",
      "query",
      "src_endpoint",
      "url",
      "user"
    ]
  }
}