{
  "caption": "Logger",
  "description": "The Logger object represents the device and product where events are stored with times for receipt and transmission.  This may be at the source device where the event occurred, a remote scanning device, intermediate hops, or the ultimate destination.",
  "extends": "_entity",
  "name": "logger",
  "attributes": {
    "device": {
      "description": "The device where the events are logged.",
      "requirement": "recommended"
    },
    "event_uid": {
      "description": "The unique identifier of the event assigned by the logger.",
      "requirement": "optional"
    },
    "is_truncated": {
      "description": "Indicates whether the OCSF event data has been truncated due to size limitations. When <code>true</code>, some event data may have been omitted to fit within system constraints.",
      "requirement": "optional"
    },
    "log_format": {
      "description": "The format of data in the log. For example JSON, syslog or CSV.",
      "requirement": "optional"
    },
    "log_level": {
      "description": "The level at which an event was logged. This can be log provider specific. For example the audit level.",
      "requirement": "optional"
    },
    "log_name": {
      "description": "The log name for the logging provider log, or the file name of the system log. This may be an intermediate store-and-forward log or a vendor destination log. For example /archive/server1/var/log/messages.0 or /var/log/.",
      "requirement": "recommended"
    },
    "log_provider": {
      "description": "The logging provider or logging service that logged the event. This may be an intermediate application store-and-forward log or a vendor destination log.",
      "requirement": "recommended"
    },
    "log_version": {
      "description": "The event log schema version of the original event. For example the syslog version or the Cisco Log Schema version",
      "requirement": "optional"
    },
    "logged_time": {
      "requirement": "recommended"
    },
    "name": {
      "description": "The name of the logging product instance.",
      "requirement": "recommended"
    },
    "product": {
      "description": "The product logging the event.  This may be the event source product, a management server product, a scanning product, a SIEM, etc.",
      "requirement": "recommended"
    },
    "transmit_time": {
      "description": "The time when the event was transmitted from the logging device to it's next destination.",
      "requirement": "recommended"
    },
    "uid": {
      "description": "The unique identifier of the logging product instance.",
      "requirement": "recommended"
    },
    "untruncated_size": {
      "description": "The original size of the OCSF event data in kilobytes before any truncation occurred. This field is typically populated when <code>is_truncated</code> is <code>true</code> to indicate the full size of the original event.",
      "requirement": "optional"
    },
    "version": {
      "description": "The version of the logging provider.",
      "requirement": "optional"
    }
  }
}