{
  "caption": "Managed Entity",
  "description": "The Managed Entity object describes the type and version of an entity, such as a user, device, or policy.  For types in the <code>type_id</code> enum list, an associated attribute should be populated.  If the type of entity is not in the <code>type_id</code> list, information can be put into the <code>data</code> attribute, <code>type_id</code> should be 'Other' and the <code>type</code> attribute should label the entity type.",
  "extends": "_entity",
  "name": "managed_entity",
  "attributes": {
    "data": {
      "description": "The managed entity content as a JSON object.",
      "requirement": "optional"
    },
    "device": {
      "requirement": "recommended"
    },
    "email": {
      "requirement": "recommended"
    },
    "group": {
      "requirement": "recommended"
    },
    "location": {
      "requirement": "optional"
    },
    "name": {
      "description": "The name of the managed entity. It should match the name of the specific entity object's name if populated, or the name of the managed entity if the <code>type_id</code> is 'Other'."
    },
    "org": {
      "description": "The Organization object containing details about the managed organizational entity. This object includes properties such as the organization name, unique identifier, type, and other organizational metadata. This attribute should be populated when <code>type_id</code> is <code>4</code> (Organization).",
      "requirement": "recommended"
    },
    "policy": {
      "description": "Describes details of a managed policy.",
      "requirement": "recommended"
    },
    "type": {
      "description": "The managed entity type. For example: <code>Policy</code>, <code>User</code>, <code>Organization</code>, <code>Device</code>.",
      "requirement": "recommended"
    },
    "type_id": {
      "description": "The type of the Managed Entity. It is recommended to also populate the <code>type</code> attribute with the associated label, or the source specific name if <code>Other</code>.",
      "requirement": "recommended",
      "enum": {
        "1": {
          "caption": "Device",
          "description": "A managed Device entity.  This item corresponds to population of the <code>device</code> attribute."
        },
        "2": {
          "caption": "User",
          "description": "A managed User entity.  This item corresponds to population of the <code>user</code> attribute."
        },
        "3": {
          "caption": "Group",
          "description": "A managed Group entity.  This item corresponds to population of the <code>group</code> attribute."
        },
        "4": {
          "caption": "Organization",
          "description": "A managed Organization entity.  This item corresponds to population of the <code>org</code> attribute."
        },
        "5": {
          "caption": "Policy",
          "description": "A managed Policy entity.  This item corresponds to population of the <code>policy</code> attribute."
        },
        "6": {
          "caption": "Email",
          "description": "A managed Email entity.  This item corresponds to population of the <code>email</code> attribute."
        },
        "7": {
          "caption": "Network Zone",
          "description": "A managed Network Zone entity. Populate the <code>name</code> attribute with the zone name and/or the <code>uid</code> attribute with the zone ID. Additional zone information can be added to the <code>data</code> attribute."
        }
      }
    },
    "uid": {
      "description": "The identifier of the managed entity. It should match the <code>uid</code> of the specific entity's object UID if populated, or the source specific ID if the <code>type_id</code> is 'Other'."
    },
    "user": {
      "requirement": "recommended"
    },
    "version": {
      "description": "The version of the managed entity. For example: <code>1.2.3</code>.",
      "requirement": "recommended"
    }
  },
  "constraints": {
    "at_least_one": [
      "name",
      "uid",
      "device",
      "group",
      "org",
      "policy",
      "user"
    ]
  }
}
