{
  "caption": "Network Traffic",
  "description": "The Network Traffic object describes characteristics of network traffic. Network traffic refers to data moving across a network at a given point of time.",
  "extends": "object",
  "name": "network_traffic",
  "attributes": {
    "aggregation_type": {
      "description": "Text name of how network traffic counters are aggregated or reported. Normalized to match the caption of <code>aggregation_type_id</code>. Possible values: Incremental, Cumulative, Combined, Instantaneous, or Other.",
      "requirement": "optional"
    },
    "aggregation_type_id": {
      "caption": "Aggregation Type ID",
      "description": "Numeric identifier defining how network traffic counters are aggregated or reported.",
      "requirement": "recommended",
      "enum": {
        "0": {
          "caption": "Unknown",
          "description": "Aggregation model is unspecified or could not be determined."
        },
        "1": {
          "caption": "Incremental",
          "description": "Values represent the change (delta) observed during a specific reporting window or time interval."
        },
        "2": {
          "caption": "Cumulative",
          "description": "Values represent total counts accumulated since the beginning of the flow or observation period."
        },
        "3": {
          "caption": "Combined",
          "description": "Values include both delta (incremental) and total (cumulative) counters reported together."
        },
        "4": {
          "caption": "Instantaneous",
          "description": "Represents a single unaggregated (raw) network observation, such as one packet or one discrete event."
        },
        "99": {
          "caption": "Other",
          "description": "Aggregation model is non-standard or custom-defined by the event source."
        }
      }
    },
    "bytes": {
      "description": "The total number of bytes transferred in both directions (sum of bytes_in and bytes_out). In the combined model, this represents the delta (incremental) bytes transferred during the current reporting interval.",
      "requirement": "recommended"
    },
    "bytes_in": {
      "description": "The number of bytes sent from the destination to the source (inbound direction). In the combined model, this represents the delta (incremental) bytes_in for the current reporting interval.",
      "requirement": "optional"
    },
    "bytes_out": {
      "description": "The number of bytes sent from the source to the destination (outbound direction). In the combined model, this represents the delta (incremental) bytes_out for the current reporting interval.",
      "requirement": "optional"
    },
    "bytes_missed": {
      "description": "The number of bytes that were missed during observation, typically due to packet loss or sampling limitations. In the combined model, this represents the delta (incremental) bytes missed during the current reporting interval.",
      "requirement": "optional"
    },
    "chunks": {
      "description": "The total number of chunks transferred in both directions (sum of chunks_in and chunks_out). In the combined model, this represents the delta (incremental) chunks transferred during the current reporting interval.",
      "requirement": "optional"
    },
    "chunks_in": {
      "description": "The number of chunks sent from the destination to the source (inbound direction). In the combined model, this represents the delta (incremental) chunks_in for the current reporting interval.",
      "requirement": "optional"
    },
    "chunks_out": {
      "description": "The number of chunks sent from the source to the destination (outbound direction). In the combined model, this represents the delta (incremental) chunks_out for the current reporting interval.",
      "requirement": "optional"
    },
    "packets": {
      "description": "The total number of packets transferred in both directions (sum of packets_in and packets_out). In the combined model, this represents the delta (incremental) packets transferred during the current reporting interval.",
      "requirement": "recommended"
    },
    "packets_in": {
      "description": "The number of packets sent from the destination to the source (inbound direction). In the combined model, this represents the delta (incremental) packets_in for the current reporting interval.",
      "requirement": "optional"
    },
    "packets_out": {
      "description": "The number of packets sent from the source to the destination (outbound direction). In the combined model, this represents the delta (incremental) packets_out for the current reporting interval.",
      "requirement": "optional"
    },
    "start_time": {
      "description": "Start time of the observation period. In the combined and incremental models, this value differs from the base event's <code>start_time</code> and marks the start of the current reporting window. In the cumulative model, it marks the start time of the flow or observation period.",
      "requirement": "optional"
    },
    "end_time": {
      "description": "End time of the observation period. In the combined and incremental models, this marks the end of the current reporting window. In the cumulative model, it marks the end time of the flow or observation period.",
      "requirement": "optional"
    },
    "cumulative_bytes": {
      "requirement": "optional"
    },
    "cumulative_bytes_in": {
      "requirement": "optional"
    },
    "cumulative_bytes_missed": {
      "requirement": "optional"
    },
    "cumulative_bytes_out": {
      "requirement": "optional"
    },
    "cumulative_chunks": {
      "requirement": "optional"
    },
    "cumulative_chunks_in": {
      "requirement": "optional"
    },
    "cumulative_chunks_out": {
      "requirement": "optional"
    },
    "cumulative_packets": {
      "requirement": "optional"
    },
    "cumulative_packets_in": {
      "requirement": "optional"
    },
    "cumulative_packets_out": {
      "requirement": "optional"
    }
  },
  "references": [
    {
      "description": "D3FEND™ Ontology d3f:NetworkTraffic",
      "url": "https://d3fend.mitre.org/dao/artifact/d3f:NetworkTraffic/"
    }
  ]
}