{
  "caption": "Network Traffic",
  "description": "The Network Traffic object describes characteristics of network traffic. Network traffic refers to data moving across a network at a given point of time.",
  "extends": "object",
  "name": "network_traffic",
  "attributes": {
    "bytes": {
      "description": "The total number of bytes transferred in both directions (sum of bytes_in and bytes_out). In the combined model, this represents the delta (incremental) bytes transferred during the current reporting interval.",
      "requirement": "recommended"
    },
    "bytes_in": {
      "description": "The number of bytes sent from the destination to the source (inbound direction). In the combined model, this represents the delta (incremental) bytes_in for the current reporting interval.",
      "requirement": "optional"
    },
    "bytes_out": {
      "description": "The number of bytes sent from the source to the destination (outbound direction). In the combined model, this represents the delta (incremental) bytes_out for the current reporting interval.",
      "requirement": "optional"
    },
    "bytes_missed": {
      "description": "The number of bytes that were missed during observation, typically due to packet loss or sampling limitations. In the combined model, this represents the delta (incremental) bytes missed during the current reporting interval.",
      "requirement": "optional"
    },
    "chunks": {
      "description": "The total number of chunks transferred in both directions (sum of chunks_in and chunks_out). In the combined model, this represents the delta (incremental) chunks transferred during the current reporting interval.",
      "requirement": "optional"
    },
    "chunks_in": {
      "description": "The number of chunks sent from the destination to the source (inbound direction). In the combined model, this represents the delta (incremental) chunks_in for the current reporting interval.",
      "requirement": "optional"
    },
    "chunks_out": {
      "description": "The number of chunks sent from the source to the destination (outbound direction). In the combined model, this represents the delta (incremental) chunks_out for the current reporting interval.",
      "requirement": "optional"
    },
    "packets": {
      "description": "The total number of packets transferred in both directions (sum of packets_in and packets_out). In the combined model, this represents the delta (incremental) packets transferred during the current reporting interval.",
      "requirement": "recommended"
    },
    "packets_in": {
      "description": "The number of packets sent from the destination to the source (inbound direction). In the combined model, this represents the delta (incremental) packets_in for the current reporting interval.",
      "requirement": "optional"
    },
    "packets_out": {
      "description": "The number of packets sent from the source to the destination (outbound direction). In the combined model, this represents the delta (incremental) packets_out for the current reporting interval.",
      "requirement": "optional"
    },
    "start_time": {
      "description": "The start time of the observation or reporting period.",
      "requirement": "optional"
    },
    "end_time": {
      "description": "The end time of the observation or reporting period.",
      "requirement": "optional"
    }
  },
  "references": [
    {
      "description": "D3FEND™ Ontology d3f:NetworkTraffic",
      "url": "https://d3fend.mitre.org/dao/artifact/d3f:NetworkTraffic/"
    }
  ]
}