{
  "caption": "OSINT",
  "description": "The OSINT (Open Source Intelligence) object contains details related to an indicator such as the indicator itself, related indicators, geolocation, registrar information, subdomains, analyst commentary, and other contextual information. This information can be used to further enrich a detection or finding by providing decisioning support to other analysts and engineers.",
  "extends": "object",
  "name": "osint",
  "attributes": {
    "answers": {
      "caption": "Related DNS Answers",
      "description": "Any pertinent DNS answers information related to an indicator or OSINT analysis.",
      "requirement": "optional"
    },
    "attacks": {
      "description": "MITRE ATT&CK Tactics, Techniques, and/or Procedures (TTPs) pertinent to an indicator or OSINT analysis.",
      "requirement": "optional"
    },
    "autonomous_system": {
      "description": "Any pertinent autonomous system information related to an indicator or OSINT analysis.",
      "requirement": "optional"
    },
    "campaign": {
      "requirement": "optional"
    },
    "category": {
      "description": "Categorizes the threat indicator based on its functional or operational role.",
      "requirement": "optional"
    },
    "comment": {
      "caption": "Analyst Comments",
      "description": "Analyst commentary or source commentary about an indicator or OSINT analysis.",
      "requirement": "optional"
    },
    "confidence": {
      "description": "The confidence of an indicator being malicious and/or pertinent, normalized to the caption of the confidence_id value. In the case of 'Other', it is defined by the event source or analyst.",
      "requirement": "optional"
    },
    "confidence_id": {
      "description": "The normalized confidence refers to the accuracy of collected information related to the OSINT or how pertinent an indicator or analysis is to a specific event or finding. A low confidence means that the information collected or analysis conducted lacked detail or is not accurate enough to qualify an indicator as fully malicious.",
      "requirement": "recommended"
    },
    "created_time": {
      "description": "The timestamp when the indicator was initially created or identified.",
      "requirement": "optional"
    },
    "creator": {
      "description": "The identifier of the user, system, or organization that contributed the indicator.",
      "requirement": "optional"
    },
    "desc": {
      "description": "A detailed explanation of the indicator, including its context, purpose, and relevance.",
      "requirement": "optional"
    },
    "detection_pattern": {
      "description": "The specific detection pattern or signature associated with the indicator.",
      "requirement": "optional"
    },
    "detection_pattern_type": {
      "requirement": "optional"
    },
    "detection_pattern_type_id": {
      "requirement": "optional"
    },
    "email": {
      "caption": "Related Email",
      "description": "Any email information pertinent to an indicator or OSINT analysis.",
      "requirement": "optional"
    },
    "email_auth": {
      "caption": "Related Email Authentication",
      "description": "Any email authentication information pertinent to an indicator or OSINT analysis.",
      "requirement": "optional"
    },
    "expiration_time": {
      "description": "The expiration date of the indicator, after which it is no longer considered reliable.",
      "requirement": "optional"
    },
    "external_uid": {
      "requirement": "optional"
    },
    "file": {
      "caption": "Related File",
      "description": "Any pertinent file information related to an indicator or OSINT analysis.",
      "requirement": "optional"
    },
    "intrusion_sets": {
      "requirement": "optional"
    },
    "kill_chain": {
      "description": "Lockheed Martin Kill Chain Phases pertinent to an indicator or OSINT analysis.",
      "requirement": "optional"
    },
    "labels": {
      "description": "Tags or keywords associated with the indicator to enhance searchability.",
      "requirement": "optional"
    },
    "location": {
      "description": "Any pertinent geolocation information related to an indicator or OSINT analysis.",
      "requirement": "optional"
    },
    "malware": {
      "requirement": "optional"
    },
    "modified_time": {
      "description": "The timestamp of the last modification or update to the indicator.",
      "requirement": "optional"
    },
    "name": {
      "description": "The <code>name</code> is a pointer/reference to an attribute within the OCSF event data. For example: file.name.",
      "requirement": "optional"
    },
    "references": {
      "description": "Provides a reference to an external source of information related to the CTI being represented. This may include a URL, a document, or some other type of reference that provides additional context or information about the CTI.",
      "requirement": "optional"
    },
    "related_analytics": {
      "caption": "Related Analytics",
      "description": "Any analytics related to an indicator or OSINT analysis.",
      "requirement": "optional"
    },
    "reputation": {
      "description": "Related reputational analysis from third-party engines and analysts for a given indicator or OSINT analysis.",
      "requirement": "optional"
    },
    "risk_score": {
      "description": "A numerical representation of the threat indicator’s risk level.",
      "requirement": "optional"
    },
    "script": {
      "caption": "Related Script Data",
      "description": "Any pertinent script information related to an indicator or OSINT analysis.",
      "requirement": "optional"
    },
    "severity": {
      "description": "Represents the severity level of the threat indicator, typically reflecting its potential impact or damage.",
      "requirement": "optional"
    },
    "severity_id": {
      "description": "The normalized severity level of the threat indicator, typically reflecting its potential impact or damage.",
      "requirement": "optional"
    },
    "signatures": {
      "caption": "Related Digital Signatures",
      "description": "Any digital signatures or hashes related to an indicator or OSINT analysis.",
      "requirement": "optional"
    },
    "src_url": {
      "description": "The source URL of an indicator or OSINT analysis, e.g., a URL back to a TIP, report, or otherwise.",
      "requirement": "optional"
    },
    "subdomains": {
      "caption": "Related Subdomains",
      "description": "Any pertinent subdomain information - such as those generated by a Domain Generation Algorithm - related to an indicator or OSINT analysis.",
      "requirement": "optional"
    },
    "subnet": {
      "caption": "Related Subnet",
      "description": "A CIDR or network block related to an indicator or OSINT analysis.",
      "requirement": "optional"
    },
    "threat_actor": {
      "requirement": "optional"
    },
    "tlp": {
      "caption": "Traffic Light Protocol",
      "description": "The <a target='_blank' href='https://www.first.org/tlp/'>Traffic Light Protocol</a> was created to facilitate greater sharing of potentially sensitive information and more effective collaboration. TLP provides a simple and intuitive schema for indicating with whom potentially sensitive information can be shared.",
      "requirement": "recommended",
      "type": "string_t",
      "enum": {
        "AMBER": {
          "caption": "TLP:AMBER",
          "description": "TLP:AMBER is for limited disclosure, recipients can only spread this on a need-to-know basis within their organization and its clients. Note that TLP:AMBER+STRICT restricts sharing to the organization only. Sources may use TLP:AMBER when information requires support to be effectively acted upon, yet carries risk to privacy, reputation, or operations if shared outside of the organizations involved. Recipients may share TLP:AMBER information with members of their own organization and its clients, but only on a need-to-know basis to protect their organization and its clients and prevent further harm. Note: if the source wants to restrict sharing to the organization only, they must specify TLP:AMBER+STRICT."
        },
        "AMBER STRICT": {
          "caption": "TLP:AMBER+STRICT",
          "description": "TLP:AMBER is for limited disclosure, recipients can only spread this on a need-to-know basis within their organization and its clients. Note that TLP:AMBER+STRICT restricts sharing to the organization only. Sources may use TLP:AMBER when information requires support to be effectively acted upon, yet carries risk to privacy, reputation, or operations if shared outside of the organizations involved. Recipients may share TLP:AMBER information with members of their own organization and its clients, but only on a need-to-know basis to protect their organization and its clients and prevent further harm. Note: if the source wants to restrict sharing to the organization only, they must specify TLP:AMBER+STRICT."
        },
        "CLEAR": {
          "caption": "TLP:CLEAR",
          "description": "TLP:CLEAR denotes that recipients can spread this to the world, there is no limit on disclosure. Sources may use TLP:CLEAR when information carries minimal or no foreseeable risk of misuse, in accordance with applicable rules and procedures for public release. Subject to standard copyright rules, TLP:CLEAR information may be shared without restriction."
        },
        "GREEN": {
          "caption": "TLP:GREEN",
          "description": "TLP:GREEN is for limited disclosure, recipients can spread this within their community. Sources may use TLP:GREEN when information is useful to increase awareness within their wider community. Recipients may share TLP:GREEN information with peers and partner organizations within their community, but not via publicly accessible channels. TLP:GREEN information may not be shared outside of the community. Note: when “community” is not defined, assume the cybersecurity/defense community."
        },
        "RED": {
          "caption": "TLP:RED",
          "description": "TLP:RED is for the eyes and ears of individual recipients only, no further disclosure. Sources may use TLP:RED when information cannot be effectively acted upon without significant risk for the privacy, reputation, or operations of the organizations involved. Recipients may therefore not share TLP:RED information with anyone else. In the context of a meeting, for example, TLP:RED information is limited to those present at the meeting."
        },
        "WHITE": {
          "caption": "TLP:WHITE",
          "description": "TLP:WHITE and TLP:CLEAR may be used interchangeably, TLP:WHITE is the most up to date (as of TLP 2.0) usage."
        }
      }
    },
    "type": {
      "description": "The OSINT indicator type.",
      "requirement": "optional"
    },
    "type_id": {
      "caption": "Indicator Type ID",
      "description": "The OSINT indicator type ID.",
      "requirement": "required",
      "enum": {
        "0": {
          "caption": "Unknown",
          "description": "The indicator type is ambiguous or there is not a related indicator for the OSINT object."
        },
        "1": {
          "caption": "IP Address",
          "description": "An IPv4 or IPv6 address."
        },
        "2": {
          "caption": "Domain",
          "description": "A full-qualified domain name (FQDN), subdomain, or partial domain."
        },
        "3": {
          "caption": "Hostname",
          "description": "A hostname or computer name."
        },
        "4": {
          "caption": "Hash",
          "description": "Any type of hash e.g., MD5, SHA1, SHA2, BLAKE, BLAKE2, SSDEEP, VHASH, etc. generated from a file, malware sample, request header, or otherwise used to identify a pertinent artifact."
        },
        "5": {
          "caption": "URL",
          "description": "A Uniform Resource Locator (URL) or Uniform Resource Indicator (URI)."
        },
        "6": {
          "caption": "User Agent",
          "description": "A User Agent typically seen in HTTP request headers."
        },
        "7": {
          "caption": "Digital Certificate",
          "description": "The serial number, fingerprint, or full content of an X.509 digital certificate."
        },
        "8": {
          "caption": "Email",
          "description": "The contents of an email or any related information to an email object."
        },
        "9": {
          "caption": "Email Address",
          "description": "An email address."
        },
        "10": {
          "caption": "Vulnerability",
          "description": "A CVE ID, CWE ID, or other identifier for a weakness, exploit, bug, or misconfiguration."
        },
        "11": {
          "caption": "File",
          "description": "A file or metadata about a file."
        },
        "12": {
          "caption": "Registry Key",
          "description": "A Windows Registry Key."
        },
        "13": {
          "caption": "Registry Value",
          "description": "A Windows Registry Value."
        },
        "14": {
          "caption": "Command Line",
          "description": "A partial or full Command Line used to invoke scripts or other remote commands."
        },
        "99": {
          "caption": "Other",
          "description": "The indicator type is not directly listed."
        }
      }
    },
    "uid": {
      "description": "The unique identifier for the OSINT object.",
      "requirement": "optional"
    },
    "uploaded_time": {
      "description": "The timestamp indicating when the associated indicator or intelligence was added to the system or repository.",
      "requirement": "optional"
    },
    "value": {
      "caption": "Indicator",
      "description": "The actual indicator value in scope, e.g., a SHA-256 hash hexdigest or a domain name.",
      "requirement": "required"
    },
    "vendor_name": {
      "description": "The vendor name of a tool which generates intelligence or provides indicators.",
      "requirement": "optional"
    },
    "vulnerabilities": {
      "caption": "Related Vulnerabilities",
      "description": "Any vulnerabilities related to an indicator or OSINT analysis.",
      "requirement": "optional"
    },
    "whois": {
      "description": "Any pertinent WHOIS information related to an indicator or OSINT analysis.",
      "requirement": "optional"
    }
  }
}