{
  "caption": "Resource Details",
  "description": "The Resource Details object describes details about resources that were affected by the activity/event.",
  "extends": "_resource",
  "name": "resource_details",
  "attributes": {
    "agent_list": {
      "requirement": "optional"
    },
    "cloud_partition": {
      "description": "The logical grouping or isolated segment within a cloud provider's infrastructure where the resource is located. Examples include AWS partitions (aws, aws-cn, aws-us-gov), Azure cloud environments (AzureCloud, AzureUSGovernment, AzureChinaCloud), or similar logical divisions in other cloud providers.",
      "profile": "cloud",
      "requirement": "optional"
    },
    "criticality": {
      "description": "The criticality of the resource as defined by the event source.",
      "requirement": "optional"
    },
    "group": {
      "description": "The name of the related resource group.",
      "requirement": "optional"
    },
    "hostname": {
      "description": "The fully qualified name of the resource.",
      "requirement": "recommended"
    },
    "ip": {
      "description": "The IP address of the resource, in either IPv4 or IPv6 format.",
      "requirement": "recommended"
    },
    "is_backed_up": {
      "requirement": "optional"
    },
    "name": {
      "observable": 38,
      "requirement": "recommended"
    },
    "namespace": {
      "description": "The namespace is useful when similar entities exist that you need to keep separate.",
      "requirement": "optional"
    },
    "owner": {
      "description": "The details of the entity that owns the resource. This object includes properties such as the owner's name, unique identifier, type, domain, and other relevant attributes that help identify the resource owner within the environment.",
      "requirement": "recommended"
    },
    "region": {
      "description": "The cloud region where the resource is hosted, as defined by the cloud provider. This represents the physical or logical geographic area containing the infrastructure supporting the resource. Examples include AWS regions (us-east-1, eu-west-1), Azure regions (East US, West Europe), GCP regions (us-central1, europe-west1), or Oracle Cloud regions (us-ashburn-1, uk-london-1).",
      "profile": "cloud",
      "requirement": "optional"
    },
    "resource_relationship": {
      "description": "A graph representation showing how this resource relates to and interacts with other entities in the environment. This can include parent/child relationships, dependencies, or other connections.",
      "requirement": "optional"
    },
    "role": {
      "description": "The role of the resource in the context of the event or finding, normalized to the caption of the role_id value. In the case of 'Other', it is defined by the event source.",
      "requirement": "optional"
    },
    "role_id": {
      "description": "The normalized identifier of the resource's role in the context of the event or finding.",
      "requirement": "recommended",
      "enum": {
        "1": {
          "caption": "Target",
          "description": "The resource is the primary target or subject of the event/finding."
        },
        "2": {
          "caption": "Actor",
          "description": "The resource is acting as the initiator or performer in the context of the event/finding."
        },
        "3": {
          "caption": "Affected",
          "description": "The resource was impacted or affected by the event/finding."
        },
        "4": {
          "caption": "Related",
          "description": "The resource is related to or associated with the event/finding."
        }
      }
    },
    "version": {
      "description": "The version of the resource. For example <code>1.2.3</code>.",
      "requirement": "optional"
    },
    "zone": {
      "caption": "Cloud Availability Zone",
      "description": "The availability zone within a cloud region where the resource is located. Examples include AWS availability zones (us-east-1a, us-east-1b), Azure availability zones (1, 2, 3 within a region), GCP zones (us-central1-a, us-central1-b), or Oracle Cloud availability domains (AD-1, AD-2, AD-3).",
      "profile": "cloud",
      "requirement": "optional"
    }
  },
  "profiles": [
    "cloud"
  ]
}
