{
  "caption": "STIX Intrusion Set",
  "description": "The <a target='_blank' href='https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_5ol9xlbbnrdn'>Intrusion Set</a> object describes a grouped set of adversarial behaviors and resources with common properties that is believed to be orchestrated by a single organization. An Intrusion Set may capture multiple Campaigns or other activities that are all tied together by shared attributes indicating a commonly known or unknown Threat Actor. New activity can be attributed to an Intrusion Set even if the Threat Actors behind the attack are not known. Threat Actors can move from supporting one Intrusion Set to supporting another, or they may support multiple Intrusion Sets. as defined in <a target='_blank' href='https://oasis-open.github.io/cti-documentation/stix/intro.html#stix-21-objects'>STIX 2.1 STIX Domain Objects (SDOs)</a>. Where a Campaign is a set of attacks over a period of time against a specific set of targets to achieve some objective, an Intrusion Set is the entire attack package and may be used over a very long period of time in multiple Campaigns to achieve potentially multiple purposes. While sometimes an Intrusion Set is not active, or changes focus, it is usually difficult to know if it has truly disappeared or ended. Analysts may have varying level of fidelity on attributing an Intrusion Set back to Threat Actors and may be able to only attribute it back to a nation state or perhaps back to an organization within that nation state.",
  "extends": "stix_object",
  "name": "stix_intrusion_set",
  "attributes": {
    "name": {
			"description": "A name used to identify this Intrusion Set.",
      "requirement": "required"
    },
    "desc": {
			"description": "A description that provides more details and context about the Intrusion Set, potentially including its purpose and its key characteristics.",
      "requirement": "optional"
    },
    "aliases": {
			"description": "Alternative names used to identify this Intrusion Set.",
      "requirement": "optional"
    },
		"first_seen_time": {
			"description": "The time that this Intrusion Set was first seen. This property is a summary property of data from sightings and other data that may or may not be available in STIX. If new sightings are received that are earlier than the first seen timestamp, the object may be updated to account for the new data.",
			"requirement": "optional"
		},
		"last_seen_time": {
			"description": "The time that this Intrusion Set was last seen. This property is a summary property of data from sightings and other data that may or may not be available in STIX. If new sightings are received that are later than the last seen timestamp, the object may be updated to account for the new data. If this property and the first_seen property are both defined, then this property MUST be greater than or equal to the timestamp in the first_seen property.",
			"requirement": "optional"
		},
		"goals": {
			"description": "The high-level goals of this Intrusion Set, namely, what are they trying to do. For example, they may be motivated by personal gain, but their goal is to steal credit card numbers. To do this, they may execute specific Campaigns that have detailed objectives like compromising point of sale systems at a large retailer. Another example: to gain information about latest merger and IPO information from ACME Bank.",
			"requirement": "optional"
		},
		"resource_level": {
			"description": "This property specifies the organizational level at which this Intrusion Set typically works, which in turn determines the resources available to this Intrusion Set for use in an attack. The value for this property SHOULD come from the <code>attack-resource-level-ov</code> open vocabulary.",
			"requirement": "optional"
		},
		"motivation": {
			"caption": "Primary Motivation",
			"description": "The primary reason, motivation, or purpose behind this Intrusion Set. The motivation is why the Intrusion Set wishes to achieve the goal (what they are trying to achieve). For example, an Intrusion Set with a goal to disrupt the finance sector in a country might be motivated by ideological hatred of capitalism. The value for this property SHOULD come from the <code>attack-motivation-ov</code> open vocabulary.",
			"requirement": "optional"
		},
		"motivations": {
			"caption": "Secondary Motivations",
			"description": "The secondary reasons, motivations, or purposes behind this Intrusion Set. These motivations can exist as an equal or near-equal cause to the primary motivation. However, it does not replace or necessarily magnify the primary motivation, but it might indicate additional context. The position in the list has no significance. The values for this property SHOULD come from the <code>attack-motivation-ov</code> open vocabulary.",
			"requirement": "optional"
		}
  }
}