{
    "caption": "STIX Object",
    "description": "The STIX Object defines the common properties that MAY exist on a STIX Objects. While some STIX Objects use all of these common properties, not all object types do as defined in Section 3.2 Common Properties in the <a target='_blank' href='https://oasis-open.github.io/cti-documentation/stix/intro.html#stix-21-objects'>STIX 2.1 STIX Domain Objects (SDOs)</a> specification.",
    "extends": "object",
		"name": "stix_object",
		"attributes": {
			"type": {
				"description": "The type property identifies the type of STIX Object. The value of the type property MUST be the name of one of the types of STIX Objects.",
				"requirement": "recommended"
			},
			"version": {
				"caption": "Spec Version",
				"description": "The version of the STIX specification used to represent this object.",
				"requirement": "recommended"
			},
			"uid": {
				"description": "The <code>id</code> property uniquely identifies this object. STIX Domain Objects, STIX Relationship Objects, STIX Meta Objects, and STIX Bundle Object SHOULD use UUIDv4 for the UUID portion of the identifier. Producers using something other than UUIDv4 need to be mindful of potential collisions and should use a namespace that guarantees uniqueness, however, they MUST NOT use a namespace of <code>00abedb4-aa42-466c-9c01-fed23315a9b7</code> if generating a UUIDv5. For objects that support versioning, all objects with the same id are considered different versions of the same object and the version of the object is identified by its modified property.",
				"requirement": "recommended"
			},
			"created_by_ref": {
				"requirement": "optional"
			},
			"desc": {
				"description": "A description that provides more details and context about the Campaign, potentially including its purpose and its key characteristics.",
				"requirement": "optional"
			},
			"aliases": {
				"requirement": "optional"
			},
			"created_time": {
				"caption": "Created",
				"description": "The created property represents the time at which the object was originally created. The object creator can use the time it deems most appropriate as the time the object was created. The minimum precision MUST be milliseconds (three digits after the decimal place in seconds), but MAY be more precise. The created property MUST NOT be changed when creating a new version of the object.",
				"requirement": "optional"
			},
			"modified_time": {
				"caption": "Modified",
				"description": "The modified property is only used by STIX Objects that support versioning and represents the time that this particular version of the object was last modified. The object creator can use the time it deems most appropriate as the time this version of the object was modified. The minimum precision MUST be milliseconds (three digits after the decimal place in seconds), but MAY be more precise. If the created property is defined, then the value of the modified property for a given object version MUST be later than or equal to the value of the created property. Object creators MUST set the modified property when creating a new version of an object if the created property was set.",
				"requirement": "optional"
			},
			"revoked": {
				"requirement": "recommended"
			},
			"labels": {
				"description": "The labels property specifies a set of terms used to describe this object. The terms are user-defined or trust-group defined and their meaning is outside the scope of this specification and MAY be ignored.",
				"requirement": "optional"
			},
			"confidence_score": {
				"description": "The confidence property identifies the confidence that the creator has in the correctness of their data. The confidence value MUST be a number in the range of 0-100. If the confidence property is not present, then the confidence of the content is unspecified.",
				"requirement": "recommended"
			},
			"lang": {
				"description": "The lang property identifies the language of the text content in this object. When present, it MUST be a language code conformant to <a target='_blank' href='https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#kix.1js008hntuzu'>RFC5646</a>. If the property is not present, then the language of the content is <code>en</code> (English). This property SHOULD be present if the object type contains translatable text properties (e.g. name, description).",
				"requirement": "optional"
			},
			"object_marking_refs": {
				"requirement": "optional"
			},
			"granular_markings": {
				"requirement": "optional"
			},
			"defanged": {
				"requirement": "optional"
			},
			"stix_extensions": {
				"requirement": "optional"
			}
		}
	}