{
  "caption": "Token",
  "description": "The Token object is the base object for representing tokens, API keys, and authentication credentials used across different contexts. This object provides common attributes for all token types, including protocol-specific authentication tokens (Kerberos, OIDC, SAML) and API/client tokens used for service authentication. When to use this object: Use the base <code>token</code> object directly in API activity events to represent API tokens, client tokens, or API keys used to authenticate API requests. Examples include: Okta API tokens, Microsoft Entra ID Application Registration client secrets, Stripe API keys, AWS API keys. When NOT to use this object: Do NOT use the base <code>token</code> object for protocol-specific authentication tokens in authentication events - use <code>authentication_token</code> instead (which extends this object). Do NOT use <code>token</code> for tracking credential lifecycle and usage patterns - use <code>programmatic_credential</code> instead.",
  "extends": "object",
  "name": "token",
  "attributes": {
    "created_time": {
      "description": "The time that the token was created.",
      "requirement": "recommended"
    },
    "expiration_time": {
      "description": "The expiration time of the token.",
      "requirement": "optional"
    },
    "is_renewable": {
      "description": "Indicates whether the token is renewable.",
      "requirement": "optional"
    },
    "modified_time": {
      "description": "The last time the token was updated.",
      "requirement": "optional"
    },
    "name": {
      "description": "The human-friendly name of a token or key, if available, such as the <code>name</code> from the Okta API Token API.",
      "requirement": "optional"
    },
    "tenant_uid": {
      "description": "The unique identifier of the tenant or organization that owns the token or key, or the tenant context in which the token is authorized for use. This is particularly relevant in multi-tenant Identity Provider scenarios where tokens are scoped to specific tenants.",
      "requirement": "optional"
    },
    "type": {
      "description": "The type of the token, normalized to the caption of the <code>type_id</code> value. This indicates whether the token is a Client Token, API Token, or one of the protocol-specific token types.",
      "requirement": "recommended"
    },
    "type_id": {
      "description": "The normalized token type identifier. Valid values: 0 (Unknown), 1 (Ticket Granting Ticket - Kerberos), 2 (Service Ticket - Kerberos), 3 (Identity Token - OIDC), 4 (Refresh Token - OIDC), 5 (SAML Assertion), 6 (Client Token - IdP-issued), 7 (API Token - generic API keys), 99 (Other).",
      "enum": {
        "0": {
          "caption": "Unknown",
          "description": "The token type is unknown."
        },
        "1": {
          "caption": "Ticket Granting Ticket",
          "description": "Ticket Granting Ticket (TGT) for Kerberos."
        },
        "2": {
          "caption": "Service Ticket",
          "description": "Service Ticket (ST) for Kerberos."
        },
        "3": {
          "caption": "Identity Token",
          "description": "Identity (ID) Token for OIDC."
        },
        "4": {
          "caption": "Refresh Token",
          "description": "Refresh Token for OIDC."
        },
        "5": {
          "caption": "SAML Assertion",
          "description": "Authentication Assertion for SAML."
        },
        "6": {
          "caption": "Client Token",
          "description": "Client Token issued by an Identity Provider (IdP) for application authentication. Use this value for IdP-issued tokens used for service-to-service authentication. Examples: Microsoft Entra ID Application Registration client secrets, Okta API tokens, Auth0 Machine-to-Machine tokens. Key characteristic: These tokens are issued by Identity Providers, not by individual services."
        },
        "7": {
          "caption": "API Token",
          "description": "A generic API token or API key used for authenticating API requests. Use this value for service-specific API authentication tokens that are NOT issued by Identity Providers. Examples: REST API keys, GraphQL API keys, Stripe API keys, Twilio API keys, AWS API keys. Key characteristic: These tokens are issued by individual services/platforms, not by Identity Providers."
        },
        "99": {
          "caption": "Other"
        }
      },
      "requirement": "recommended"
    },
    "uid": {
      "description": "The unique ID of a token or key, if available, such as the <code>Secret ID</code> of Entra ID Application Registration Client Secrets.",
      "requirement": "optional"
    },
    "zone": {
      "description": "The network zone or geographic region that the token or key is authorized to be used from. This may represent network-based access restrictions, geographic limitations, or other zone-based authorization policies. Examples include Okta's network zone restrictions or cloud provider region restrictions.",
      "requirement": "optional"
    }
  }
}