{
    "uid": 6,
    "caption": "Data Security Finding",
    "category": "findings",
    "description":"A Data Security Finding describes detections or alerts generated by various data security products such as Data Loss Prevention (DLP), Data Classification, Secrets Management, Digital Rights Management (DRM), Data Security Posture Management (DSPM), and similar tools. These detections or alerts can be created using fingerprinting, statistical analysis, machine learning or other methodologies. The finding describes the actors and endpoints who accessed or own the sensitive data, as well as the resources which store the sensitive data.",
    "extends": "finding",
    "name": "data_security_finding",
    "profiles": [
      "security_control"
    ],
    "attributes": {
      "$include": [
        "profiles/security_control.json"
      ],
      "activity_id": {
        "description": "The normalized identifier of the Data Security Finding activity.",
        "enum": {
          "1": {
            "caption": "Create",
            "description": "A new Data Security finding is created."
          },
          "2": {
            "caption": "Update",
            "description": "An existing Data Security finding is updated with more information."
          },
          "3": {
            "caption": "Close",
            "description": "An existing Data Security finding is closed, this can be due to any resolution (e.g., True Positive, False Positive, etc.)."
          },
          "4": {
            "caption": "Suppressed",
            "description": "An existing Data Security finding is suppressed due to inaccurate detection techniques or a known true negative."
          }
        },
        "requirement": "required"
      },
      "activity_name": {
        "description": "The Data Security finding activity name, as defined by the <code>activity_id</code>.",
        "requirement": "optional"
      },
      "impact": {
        "group": "context",
        "requirement": "optional"
      },
      "impact_id": {
        "group": "context",
        "requirement": "optional"
      },
      "impact_score": {
        "group": "context",
        "requirement": "optional"
      },
      "resources": {
        "caption": "Affected Resources",
        "description": "Describes details about resources twhere classified or sensitive data is stored in, or was accessed from.",
        "group": "context",
        "requirement": "recommended"
      },
      "actor": {
        "description": "Describes details about the actor implicated in the data security finding. Either an actor that owns a particular digital file or information store, or an actor which accessed classified or sensitive data.",
        "group": "context",
        "requirement": "recommended"
      },
      "database": {
        "description": "Describes the database where classified or sensitive data is stored in, or was accessed from. Databases are typically datastore services that contain an organized collection of structured and/or semi-structured data.",
        "group": "context",
        "requirement": "recommended"
      },
      "databucket": {
        "description": "Describes the databucket where classified or sensitive data is stored in, or was accessed from. The data bucket object is a basic container that holds data, typically organized through the use of data partitions.",
        "group": "context",
        "requirement": "recommended"
      },
      "table": {
        "description": "Describes the table where classified or sensitive data is stored in, or was accessed from. The table object represents a table within a structured relational database, warehouse, lake, or similar.",
        "group": "context",
        "requirement": "recommended"
      },
      "device": {
        "description": "Describes the device where classified or sensitive data is stored in, or was accessed from.",
        "group": "context",
        "requirement": "recommended"
      },
      "dst_endpoint": {
        "description": "Describes the endpoint where classified or sensitive data is stored in, or was accessed from.",
        "group": "context",
        "requirement": "recommended"
      },
      "file": {
        "description": "Describes a file that contains classified or sensitive data.",
        "group": "context",
        "requirement": "recommended"
      },
      "src_endpoint": {
        "caption": "Affected Resources",
        "description": "Details about the source endpoint where classified or sensitive data was accessed from.",
        "group": "context",
        "requirement": "recommended"
      },
      "risk_level": {
        "group": "context",
        "requirement": "optional"
      },
      "risk_level_id": {
        "group": "context",
        "requirement": "optional"
      },
      "risk_score": {
        "group": "context",
        "requirement": "optional"
      },
      "data_security": {
        "group": "context",
        "requirement": "recommended"
      }
    }
  }