{
  "name": "Incident Events",
  "type": "incident",
  "extends": "conclusion",
  "description": "Incident events report the creation, update and closure of incidents.",
  "attributes": {
    "comment": {
      "requirement": "optional"
    },
    "incident_uid": {
      "name": "Incident ID",
      "description": "The unique identifier of the incident.",
      "requirement": "required"
    },
    "priority": {
      "requirement": "optional"
    },
    "priority_id": {
      "description": "The normalized priority.</p>Priority identifies the relative importance of the incident. It is a measurement of urgency of the incident.",
      "requirement": "recommended",
      "enum": {
        "1": {
          "description": "Application or personal procedure unusable, where a workaround is available or a repair is possible."
        },
        "2": {
          "description": "Non-critical function or procedure, unusable or hard to use having an operational impact, but with no direct impact on services availability. A workaround is available."
        },
        "3": {
          "description": "Critical functionality or network access interrupted, degraded or unusable, having a severe impact on services availability. No acceptable alternative is possible."
        },
        "4": {
          "description": "Interruption making a critical functionality inaccessible or a complete network interruption causing a severe impact on services availability. There is no possible alternative.",
          "nme": "Critical"
        }
      }
    },
    "state": {
      "description": "The incident state.",
      "requirement": "optional"
    },
    "state_id": {
      "description": "The incident state identifier.",
      "requirement": "required",
      "enum": {
        "0": {
          "name": "Unknown",
          "description": "The incident state is not known."
        },
        "1": {
          "name": "New",
          "description": "The service desk has received the incident but has not assigned it to an agent."
        },
        "2": {
          "name": "In Progress",
          "description": "The incident has been assigned to an agent but has not been resolved. The agent is actively working with the user to diagnose and resolve the incident."
        },
        "3": {
          "name": "On Hold",
          "description": "The incident requires some information or response from the user or from a third party."
        },
        "4": {
          "name": "Resolved",
          "description": "The service desk has confirmed that the incident is resolved."
        },
        "5": {
          "name": "Closed",
          "description": "The incident is resolved and no further action is necessary."
        },
        "-1": {
          "name": "Other",
          "description": "The incident state is other. See the State attribute."
        }
      }
    }
  }
}