{
  "description": "The attributes including disposition that represent the outcome of a security control including but not limited to access control, malware or policy violation, network proxy, firewall, or data control.  The profile is intended to augment activities or findings with an outcome where a security control has intervened.",
  "meta": "profile",
  "caption": "Security Control",
  "name": "security_control",
  "annotations": {
    "group": "primary"
  },
  "attributes": {
    "action": {
      "caption": "Action",
      "description": "The normalized caption of <code>action_id</code>.",
      "requirement": "optional"
    },
    "action_id": {
      "caption": "Action ID",
      "description": "The action taken by a control or other policy-based system leading to an outcome or disposition. Dispositions conform to an action of <code>1</code> 'Allowed' or <code>2</code> 'Denied' in most cases. Note that <code>99</code> 'Other' is not an option. No action would equate to <code>1</code> 'Allowed'. An unknown action may still correspond to a known disposition. Refer to <code>disposition_id</code> for the outcome of the action.",
      "enum": {
        "0": {
          "caption": "Unknown",
          "description": "The action was unknown. The <code>disposition_id</code> attribute may still be set to a non-unknown value, for example 'Count', 'Uncorrected', 'Isolated', 'Quarantined' or 'Exonerated'."
        },
        "1": {
          "caption": "Allowed",
          "description": "The activity was allowed. The <code>disposition_id</code> attribute should be set to a value that conforms to this action, for example 'Allowed', 'Approved', 'Delayed', 'No Action', 'Count' etc."
        },
        "2": {
          "caption": "Denied",
          "description": "The attempted activity was denied. The <code>disposition_id</code> attribute should be set to a value that conforms to this action, for example 'Blocked', 'Rejected', 'Quarantined', 'Isolated', 'Dropped', 'Access Revoked, etc."
        }
      },
      "requirement": "required"
    },
    "attacks": {
      "requirement": "optional"
    },
    "authorizations": {
      "requirement": "optional"
    },
    "disposition": {
      "requirement": "optional"
    },
    "disposition_id": {
      "requirement": "recommended",
      "enum": {
        "99": {
          "caption": "Other",
          "description": "The disposition is not listed. The <code>disposition</code> attribute should be populated with a source specific caption."
        },
        "0": {
          "caption": "Unknown",
          "description": "The disposition was not known."
        },
        "1": {
          "caption": "Allowed",
          "description": "Granted access or allowed the action to the protected resource."
        },
        "2": {
          "caption": "Blocked",
          "description": "Denied access or blocked the action to the protected resource."
        },
        "3": {
          "caption": "Quarantined",
          "description": "A suspicious file or other content was moved to a benign location."
        },
        "4": {
          "caption": "Isolated",
          "description": "A session was isolated on the network or within a browser."
        },
        "5": {
          "caption": "Deleted",
          "description": "A file or other content was deleted."
        },
        "6": {
          "caption": "Dropped",
          "description": "The request was detected as a threat and resulted in the connection being dropped."
        },
        "7": {
          "caption": "Custom Action",
          "description": "A custom action was executed such as running of a command script. Use the <code>message</code> attribute of the base class for details."
        },
        "8": {
          "caption": "Approved",
          "description": "A request or submission was approved.  For example, when a form was properly filled out and submitted. This is distinct from <code>1</code> 'Allowed'."
        },
        "9": {
          "caption": "Restored",
          "description": "A quarantined file or other content was restoerd to its original location."
        },
        "10": {
          "caption": "Exonerated",
          "description": "A suspicious or risky entity was deemed to no longer be suspicious (re-scored)."
        },
        "11": {
          "caption": "Corrected",
          "description": "A corrupt file or configuration was corrected."
        },
        "12": {
          "caption": "Partially Corrected",
          "description": "A corrupt file or configuration was partially corrected."
        },
        "13": {
          "caption": "Uncorrected",
          "description": "A corrupt file or configuration was not corrected."
        },
        "14": {
          "caption": "Delayed",
          "description": "An operation was delayed, for example if a restart was required to finish the operation."
        },
        "15": {
          "caption": "Detected",
          "description": "Suspicious activity or a policy violation was detected without further action."
        },
        "16": {
          "caption": "No Action",
          "description": "The outcome of an operation had no action taken."
        },
        "17": {
          "caption": "Logged",
          "description": "The operation or action was logged without further action."
        },
        "18": {
          "caption": "Tagged",
          "description": "A file or other entity was marked with extended attributes."
        },
        "19": {
          "caption": "Alert",
          "description": "The request or activity was detected as a threat and resulted in a notification but request was not blocked."
        },
        "20": {
          "caption": "Count",
          "description": "Counted the request or activity but did not determine whether to allow it or block it."
        },
        "21": {
          "caption": "Reset",
          "description": "The request was detected as a threat and resulted in the connection being reset."
        },
        "22": {
          "caption": "Captcha",
          "description": "Required the end user to solve a CAPTCHA puzzle to prove that a human being is sending the request."
        },
        "23": {
          "caption": "Challenge",
          "description": "Ran a silent challenge that required the client session to verify that it's a browser, and not a bot."
        },
        "24": {
          "caption": "Access Revoked",
          "description": "The requestor's access has been revoked due to security policy enforcements. Note: use the <code>Host</code> profile if the <code>User</code> or <code>Actor</code> requestor is not present in the event class."
        },
        "25": {
          "caption": "Rejected",
          "description": "A request or submission was rejected.  For example, when a form was improperly filled out and submitted. This is distinct from <code>2</code> 'Blocked'."
        },
        "26": {
          "caption": "Unauthorized",
          "description": "An attempt to access a resource was denied due to an authorization check that failed. This is a more specific disposition than <code>2</code> 'Blocked' and can be complemented with the <code>authorizations</code> attribute for more detail."
        },
        "27": {
          "caption": "Error",
          "description": "An error occurred during the processing of the activity or request. Use the <code>message</code> attribute of the base class for details."
        }
      }
    },
    "firewall_rule": {
      "requirement": "optional"
    },
    "malware": {
      "requirement": "optional"
    }
  }
}
