{
  "caption": "K8s status",
  "description": "K8s status",
  "name": "k8s_status",
  "attributes": {
    "host_ip_info": {
      "requirement": "optional"
    },
    "pod_ip_info": {
      "requirement": "optional"
    },
    "status": {
      "requirement": "optional",
      "description": "The event status, normalized to the caption of the status_id value. In the case of 'Other', it is defined by the event source."
    },
    "status_id": {
      "requirement": "optional",
      "enum": {
        "1": {
          "caption": "Pending",
          "description": "The Pod has been accepted by the Kubernetes cluster, but one or more of the containers has not been set up and made ready to run. This includes time a Pod spends waiting to be scheduled as well as the time spent downloading container images over the network."
        },
        "2": {
          "caption": "Running",
          "description": "The Pod has been bound to a node, and all of the containers have been created. At least one container is still running, or is in the process of starting or restarting."
        },
        "3": {
          "caption": "Succeeded",
          "description": "All containers in the Pod have terminated in success, and will not be restarted."
        },
        "4": {
          "caption": "Failed",
            "description": "All containers in the Pod have terminated, and at least one container has terminated in failure. That is, the container either exited with non-zero status or was terminated by the system, and is not set for automatic restarting."
        },
        "5": {
          "caption": "Terminating",
          "description": "When a Pod is being deleted, it is shown as Terminating by some kubectl commands. This Terminating status is not one of the Pod phases. A Pod is granted a term to terminate gracefully, which defaults to 30 seconds."
        }
      }
    },
    "node_info": {
      "requirement": "optional"
    },
    "start_time": {
      "requirement": "optional"
    }
  }
}