{
  "uid": 7,
  "caption": "Application Security Posture Finding",
  "description": "The Application Security Posture Finding event is a notification about any bug, defect, deficiency, exploit, vulnerability, weakness or any other issue with software and related systems. Application Security Posture Findings typically involve reporting on the greater context including compliance, impacted resources, remediation guidance, specific code defects, and/or vulnerability metadata. Application Security Posture Findings can be reported by Threat & Vulnerability Management (TVM) tools, Application Security Posture Management (ASPM) tools, or other similar tools. Note: if the event producer is a security control, the <code>security_control</code> profile should be applied and its <code>attacks</code> information, if present, should be duplicated into the <code>finding_info</code> object. <br><strong>Note: </strong>If the Finding is an incident, i.e. requires incident workflow, also apply the <code>incident</code> profile or aggregate this finding into an <code>Incident Finding</code>.",
  "extends": "finding",
  "name": "application_security_posture_finding",
  "attributes": {
    "application": {
      "caption": "Related Application",
      "group": "primary",
      "requirement": "recommended"
    },
    "compliance": {
      "caption": "Related Compliance",
      "description": "Provides compliance context to vulnerabilities and other weaknesses that are reported as part of an Application Security or Vulnerability Management tool's built-in compliance framework mapping.",
      "group": "primary",
      "requirement": "recommended"
    },
    "remediation": {
      "caption": "Remediation Guidance",
      "description": "Describes the recommended remediation steps to address identified vulnerabilities or weaknesses.",
      "group": "context",
      "requirement": "recommended"
    },
    "resources": {
      "caption": "Affected Resources",
      "description": "Describes details about the resource/resources that are affected by the vulnerability/vulnerabilities.",
      "group": "context",
      "requirement": "recommended"
    },
    "vulnerabilities": {
      "group": "primary",
      "requirement": "recommended"
    }
  },
  "constraints": {
    "at_least_one": [
      "application",
      "compliance",
      "remediation",
      "vulnerabilities"
    ]
  },
  "profiles": [
    "incident"
  ]
}