{
  "uid": 6,
  "caption": "Data Security Finding",
  "description": "A Data Security Finding describes detections or alerts generated by various data security products such as Data Loss Prevention (DLP), Data Classification, Secrets Management, Digital Rights Management (DRM), Data Security Posture Management (DSPM), and similar tools. These detections or alerts can be created using fingerprinting, statistical analysis, machine learning or other methodologies. The finding describes the actors and endpoints who accessed or own the sensitive data, as well as the resources which store the sensitive data. Note: if the event producer is a security control, the <code>security_control</code> profile should be applied and its <code>attacks</code> information, if present, should be duplicated into the <code>finding_info</code> object. <br><strong>Note: </strong>If the Finding is an incident, i.e. requires incident workflow, also apply the <code>incident</code> profile  or aggregate this finding into an <code>Incident Finding</code>.",
  "extends": "finding",
  "name": "data_security_finding",
  "attributes": {
    "activity_id": {
      "description": "The normalized identifier of the Data Security Finding activity.",
      "requirement": "required",
      "enum": {
        "1": {
          "caption": "Create",
          "description": "A new Data Security finding is created."
        },
        "2": {
          "caption": "Update",
          "description": "An existing Data Security finding is updated with more information."
        },
        "3": {
          "caption": "Close",
          "description": "An existing Data Security finding is closed, this can be due to any resolution (e.g., True Positive, False Positive, etc.)."
        },
        "4": {
          "caption": "Suppressed",
          "description": "An existing Data Security finding is suppressed due to inaccurate detection techniques or a known true negative.",
          "@deprecated": {
            "message": "Use <code>status_id</code> attribute instead.",
            "since": "1.4.0"
          }
        }
      }
    },
    "activity_name": {
      "description": "The Data Security finding activity name, as defined by the <code>activity_id</code>.",
      "requirement": "optional"
    },
    "actor": {
      "description": "Describes details about the actor implicated in the data security finding. Either an actor that owns a particular digital file or information store, or an actor which accessed classified or sensitive data.",
      "group": "context",
      "requirement": "recommended",
      "profile": null
    },
    "confidence": {
      "group": "context",
      "requirement": "optional",
      "profile": null
    },
    "confidence_id": {
      "group": "context",
      "requirement": "recommended",
      "profile": null
    },
    "confidence_score": {
      "group": "context",
      "requirement": "optional",
      "profile": null
    },
    "data_security": {
      "group": "context",
      "requirement": "recommended"
    },
    "database": {
      "description": "Describes the database where classified or sensitive data is stored in, or was accessed from. Databases are typically datastore services that contain an organized collection of structured and/or semi-structured data.",
      "group": "primary",
      "requirement": "recommended"
    },
    "databucket": {
      "description": "Describes the databucket where classified or sensitive data is stored in, or was accessed from. The data bucket object is a basic container that holds data, typically organized through the use of data partitions.",
      "group": "primary",
      "requirement": "recommended"
    },
    "device": {
      "description": "Describes the device where classified or sensitive data is stored in, or was accessed from.",
      "group": "context",
      "requirement": "recommended",
      "profile": null
    },
    "dst_endpoint": {
      "description": "Describes the endpoint where classified or sensitive data is stored in, or was accessed from.",
      "group": "context",
      "requirement": "recommended"
    },
    "file": {
      "description": "Describes a file that contains classified or sensitive data.",
      "group": "primary",
      "requirement": "recommended"
    },
    "impact": {
      "group": "context",
      "requirement": "optional",
      "profile": null
    },
    "impact_id": {
      "group": "context",
      "requirement": "optional",
      "profile": null
    },
    "impact_score": {
      "group": "context",
      "requirement": "optional",
      "profile": null
    },
    "is_alert": {
      "description": "Indicates that the event is considered to be an alertable signal. For example, an <code>activity_id</code> of 'Create' could constitute an alertable signal and the value would be <code>true</code>, while 'Close' likely would not and either omit the attribute or set its value to <code>false</code>.  Note that other events with the <code>security_control</code> profile may also be deemed alertable signals and may also carry <code>is_alert = true</code> attributes.",
      "group": "primary",
      "requirement": "recommended",
      "profile": null
    },
    "resources": {
      "caption": "Additional Resources",
      "description": "Describes details about additional resources, where classified or sensitive data is stored in, or was accessed from. <p> You can populate this object, if the specific resource type objects available in the class (<code>database, databucket, table, file</code>) aren't sufficient; OR <br> You can also choose to duplicate <code>uid, name</code> of the specific resources objects, for a consistent access to resource uids across all findings.",
      "group": "primary",
      "requirement": "recommended"
    },
    "risk_details": {
      "group": "context",
      "requirement": "optional",
      "profile": null
    },
    "risk_level": {
      "group": "context",
      "requirement": "optional",
      "profile": null
    },
    "risk_level_id": {
      "group": "context",
      "requirement": "optional",
      "profile": null
    },
    "risk_score": {
      "group": "context",
      "requirement": "optional",
      "profile": null
    },
    "src_endpoint": {
      "description": "Details about the source endpoint where classified or sensitive data was accessed from.",
      "group": "context",
      "requirement": "recommended"
    },
    "table": {
      "description": "Describes the table where classified or sensitive data is stored in, or was accessed from. The table object represents a table within a structured relational database, warehouse, lake, or similar.",
      "group": "primary",
      "requirement": "recommended"
    }
  }
}